# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:

  #- [16,21, 17,36, 33,22]
  #- [22,35, 19,53, 24,43]
  #- [32,33, 32,51, 46,49]

  #- [16,20, 18,36, 32,23]
  #- [17,53, 24,38, 32,34]
  #- [23,51, 33,52, 44,48]
  #- [10,13, 16,30, 33,23]  # P3/8
  #- [30,61, 62,45, 59,119]  # P4/16
  #- [116,90, 156,198, 373,326]  # P5/32
  #company
  
  #- [11,26, 13,30, 26,17]  
  #- [17,29, 14,42, 22,41]
  #- [32,35, 38,39, 36,51]
  
  #- [15,12, 23,12, 11,28]
  #- [15,30, 28,19, 14,42]
  #- [21,40, 35,37, 35,50]
  
  - [19,13, 11,27, 15,30]
  - [27,17, 13,41, 19,39]
  - [26,32, 36,37, 33,49]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Adapt_CA, [256]],
   [-2, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Adapt_CA, [512]],
   [-2, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, Adapt_CA, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13
   [-1, 1, Adapt_CA, [512]],

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)
   [-1, 1, Adapt_CA, [256]],  #18
   [-2, 1, Adapt_CA, [256]],

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)
   [-1, 1, Adapt_CA, [512]],   #22
   [-2, 1, Adapt_CA, [512]],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 13], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)
   [-1, 1, Adapt_CA, [1024]],   #26

   [[22, 27, 32], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]